export const metadata = {
  title: "توقع الفائز بمباراة فرنسا والمغرب واربح 10,000 ريال يمني! 🏆",
  description: "شارك في مسابقة التوقعات لكأس العالم مجاناً وسجل اسمك ورقمك للدخول في السحب على 10,000 ريال يمني.",
  openGraph: {
    title: "توقع الفائز بمباراة فرنسا والمغرب واربح 10,000 ريال يمني! 🏆",
    description: "شارك في مسابقة التوقعات لكأس العالم مجاناً وسجل اسمك ورقمك للدخول في السحب على 10,000 ريال يمني.",
    images: [
      {
        url: "/share.png",
        width: 1200,
        height: 630,
        alt: "توقع واربح 10,000 ريال يمني مع كأس العالم",
      },
    ],
    type: "website",
  },
  twitter: {
    card: "summary_large_image",
    title: "توقع الفائز بمباراة فرنسا والمغرب واربح 10,000 ريال يمني! 🏆",
    description: "شارك في مسابقة التوقعات لكأس العالم مجاناً وسجل اسمك ورقمك للدخول في السحب على 10,000 ريال يمني.",
    images: ["/share.png"],
  },
};

export default function PredictLayout({ children }) {
  return children;
}
